In [2]:
import pandas as pd
df = pd.read_csv("csv_file.csv")

through this data set i came to know that this contains salary list
i want to understand the over all perfomance and the patterns

In [3]:
df.head()

            Name  Age   Department  Salary
0       John Doe   28  Engineering   75000
1     Jane Smith   34    Marketing   82000
2  Michael Brown   45        Sales   68000
3    Emily Davis   30  Engineering   79000
4   Chris Wilson   25           HR   55000

In [4]:
df.shape

(20, 4)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Age         20 non-null     int64
 2   Department  20 non-null     object
 3   Salary      20 non-null     int64
dtypes: int64(2), object(2)
memory usage: 772.0+ bytes

The dataset contains details of 20 employees, each with a unique salary value.

Along with salary, the dataset includes employee age, name, and department information.

The data spans four departments — Engineering, Marketing, Sales, and HR — allowing comparison of salary distribution across departments.

In [6]:
df.describe()

             Age        Salary
count  20.000000     20.000000
mean   33.750000  73950.000000
std     5.963706  10708.948545
min    25.000000  55000.000000
25%    29.750000  64500.000000
50%    32.500000  76000.000000
75%    38.250000  82250.000000
max    45.000000  90000.000000

mean refer to the overall average value
std  shows that the how age and salary
min it shows the minimum value present
and then maximum value

in this data set we have the age categories from 25 to 45 
and then the higest pakage offer is 90000 and the lowest is 55000
it shows only 25% can achive the package over 83000

from this data i came to know that the which department has higher salary

REFLECTION:
            YEAH IT FEELS LIKE ANALITICS MORE THAN CODING
            YES BECAUSE I CAME TO UNDERSTAND THING WLL BETTER THAN BEFORE